// 1.문제가 뭐냐 ???
// 1-1.프로그맹 위해서 필요한 단어, 개념
// 1-2 자료형, 함수
// 2. 제어문 실행할 순서, 절차에 따라 작성
// 반복 숙달만이 살아남는 방법이다...

// 선생님이 학생 점수를 입력하고 출력하는 프로그램
// 누가? 무엇을 ?
// 정수를 입력, 출력
// 정수, 실수
// 정수 ( 0 ~ 100) scanf(). printf()
// ~ 함수를 사용 시 반환, 전달

// 첫번째 실행되는게 뭔지 잘 파악해야함!!!!!
//  

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <conio.h>
#include <math.h>

int main(void) {
	// 규칙에 따르면 머리는 단순해진다...
	// 식을 만들때는 최대한 머리를 사용하라...
	// 식 : 연산자를 사용한 문장 : 산술, 관계, 논리
	// 100을 출력!!!


	int n = 100;
	printf("%d", n);









	return 0;
}

